# web - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Read complete after 0s [id=staging_gateway_api_endpoint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.vercel_deployment.default will be created
  + resource "vercel_deployment" "default" {
      + domains     = (known after apply)
      + files       = {
          + "../../../.eslintrc.json"                                          = "40~75e677e7192205173354ae9375c1d25ef78b0cec"
          + "../../../Dockerfile"                                              = "622~87f42718dbe51de66fa9ce8f7d13c9cd5e201091"
          + "../../../README.md"                                               = "1751~48b384309a1437a218793ea183aa2964b6d8d16d"
          + "../../../infrastructure/workspaces/common/outputs.tf"             = "61~2af7d6c0082ab664fb735558236323cc2f8d1054"
          + "../../../infrastructure/workspaces/common/variables.tf"           = "169~567e81bf0a78e486c49f7ec76d8ea0655d52a648"
          + "../../../infrastructure/workspaces/common_resources/locals.tf"    = "92~12157b0d56ed3f0b038dc4538cb1f3d2eae7d75a"
          + "../../../infrastructure/workspaces/common_resources/resources.tf" = "964~c7529b7ac80e0facf6c7c0f0b5167af0fc2eef88"
          + "../../../infrastructure/workspaces/common_resources/terraform.tf" = "196~f16581da91a7542df9da1e6459a3b35fa287f19e"
          + "../../../infrastructure/workspaces/common_resources/variables.tf" = "124~02167b0a3c769e2dd68dac49a2963cc488e949cd"
          + "../../../infrastructure/workspaces/production/main.tf"            = "178~7eace298ad2e508d7d6164f67e04adb336052557"
          + "../../../infrastructure/workspaces/production/providers.tf"       = "181~626fd5ce472058a8bfa879aaedab4edf119d1a7f"
          + "../../../infrastructure/workspaces/production/terraform.tf"       = "298~3c424748840f22ea31be202b6f063b48960d14c9"
          + "../../../infrastructure/workspaces/production/variables.tf"       = "414~33802f8667d12264841ff2f1176988df9e802b77"
          + "../../../infrastructure/workspaces/staging/main.tf"               = "175~e1c8b10e596d3a77b45f497c0bc7a915737608aa"
          + "../../../infrastructure/workspaces/staging/providers.tf"          = "181~626fd5ce472058a8bfa879aaedab4edf119d1a7f"
          + "../../../infrastructure/workspaces/staging/terraform.tf"          = "295~778492669fd19f2fd08e3ca29f55a099cc198719"
          + "../../../infrastructure/workspaces/staging/variables.tf"          = "414~33802f8667d12264841ff2f1176988df9e802b77"
          + "../../../next-i18next.config.js"                                  = "83~138ceb181e0eb4c27ef445a6cc1b17b41ce52fe8"
          + "../../../next.config.js"                                          = "196~c54f2500540f70182a49e0df0744e257ec19d17d"
          + "../../../package.json"                                            = "1322~33ad3e64f72f8626a20fd5b154994514cb2288fc"
          + "../../../public/favicon.ico"                                      = "10361~6aad3b7c34c152a37cfe9a847d620babf2525d81"
          + "../../../public/locales/en/common.json"                           = "50~07dde893ee049067c2b720cf1c7b55f0ed1605c7"
          + "../../../relay.config.js"                                         = "260~a964b0222bcd08baa0417d81c47d943624d8f9b1"
          + "../../../src/pages/_app.tsx"                                      = "516~f21b592a6bed98689ef85dfd70e72401eb3907cf"
          + "../../../src/pages/_document.tsx"                                 = "233~8d05897613ea6b3a88b92fda34698c305029fc8f"
          + "../../../src/pages/api/auth/[...auth0].ts"                        = "80~ba8e9c8f8fb0a4ffa061c2bfd59734d48fde560d"
          + "../../../src/pages/index.tsx"                                     = "1318~6234841af9fb59612a0f8546eec9704b3d5e09a7"
          + "../../../src/styles/Home.module.css"                              = "3856~0aca80d20664c5ba5c7f3de1aa44b40c7b2d5db6"
          + "../../../src/styles/globals.css"                                  = "2024~e3b15e17e0f8297a45df3fcb9a3a6389bae1bb48"
          + "../../../src/styles/theme/index.ts"                               = "171~8c20c1be1bf090847141cac160497f945ecd263a"
          + "../../../tsconfig.json"                                           = "556~5137f09e9ab161470edd38cb8c5813aa511a5770"
          + "../../../yarn.lock"                                               = "133845~b3f799827ee4a14c80e51cb4f9a1b2efdd3f1376"
        }
      + id          = (known after apply)
      + path_prefix = "../../../"
      + production  = true
      + project_id  = (known after apply)
      + team_id     = "connectilly"
      + url         = (known after apply)
    }

  # module.common_resources.vercel_project.default will be created
  + resource "vercel_project" "default" {
      + environment                = (sensitive value)
      + framework                  = "nextjs"
      + id                         = (known after apply)
      + name                       = "staging-web"
      + serverless_function_region = (known after apply)
      + team_id                    = "connectilly"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*